<template>
  <div v-scroll-lock="callbackPopupIsOpen">
    <Header />
    <Banner />
    <Workflow />
    <CallbackSection />
    <Benefits />

    <BasicSection waved=true>
      <Service
        :title="uslugi.kvarcvinil.title"
        :imagepath="uslugi.kvarcvinil.bannerImage"
        :banner-text="uslugi.kvarcvinil.bannerText"
        :price="uslugi.kvarcvinil.price"
        :cases="uslugi.kvarcvinil.cases"
      />
    </BasicSection>

    <BasicSection waved=true>
      <Service
        :title="uslugi.laminat.title"
        :imagepath="uslugi.laminat.bannerImage"
        :banner-text="uslugi.laminat.bannerText"
        :price="uslugi.laminat.price"
        :cases="uslugi.laminat.cases"
        :additional-text="uslugi.laminat.additionalText"
        :reversed="true"
      />
    </BasicSection>

    <BasicSection waved=true>
      <Service
        :title="uslugi.kovrolin.title"
        :imagepath="uslugi.kovrolin.bannerImage"
        :banner-text="uslugi.kovrolin.bannerText"
        :price="uslugi.kovrolin.price"
        :cases="uslugi.kovrolin.cases"
        :reversed="false"
      />
    </BasicSection>

    <BasicSection waved=true>
      <Service
        :title="uslugi.linoleum.title"
        :imagepath="uslugi.linoleum.bannerImage"
        :banner-text="uslugi.linoleum.bannerText"
        :price="uslugi.linoleum.price"
        :cases="uslugi.linoleum.cases"
        :reversed="true"
      />
    </BasicSection>

    <BasicSection waved=true>
      <Service
        :title="uslugi.parket.title"
        :imagepath="uslugi.parket.bannerImage"
        :banner-text="uslugi.parket.bannerText"
        :price="uslugi.parket.price"
        :cases="uslugi.parket.cases"
        :reversed="false"
      />
    </BasicSection>

    <BasicSection waved=true>
      <Service
        :title="uslugi.plintus.title"
        :imagepath="uslugi.plintus.bannerImage"
        :banner-text="uslugi.plintus.bannerText"
        :price="uslugi.plintus.price"
        :cases="uslugi.plintus.cases"
        :reversed="true"
      />
    </BasicSection>

    <BasicSection waved=true>
      <Service
        :title="uslugi.svarkaLinoleuma.title"
        :imagepath="uslugi.svarkaLinoleuma.bannerImage"
        :banner-text="uslugi.svarkaLinoleuma.bannerText"
        :price="uslugi.svarkaLinoleuma.price"
        :cases="uslugi.svarkaLinoleuma.cases"
        :reversed="false"
      />
    </BasicSection>

    <BasicSection>
      <Service
        :title="uslugi.polirovkaLinoleuma.title"
        :imagepath="uslugi.polirovkaLinoleuma.bannerImage"
        :banner-text="uslugi.polirovkaLinoleuma.bannerText"
        :reversed="false"
      />
    </BasicSection>

    <CallbackSection />
    <BasicSection waved=true>
      <template>
        <div class="anchor" id="o_kompanii"/>
        <div class="container">
          <h2>О компании</h2>
          <p>Компания «Акватерра» на протяжении семи лет профессионально занимается такими видами работ, как:</p>
          <AboutList />
          <p>Мы полностью уверены в качестве наших услуг и предоставляем вам гарантию 2 года на наши работы по бурению скважин.</p>
        </div>
      </template>
    </BasicSection>
    <BasicSection>
      <template>
        <div class="anchor" id="kak_my_rabotaem"/>
        <div class="container">
          <h2>Как мы работаем </h2>
          <p>Начать сотрудничать с нами очень просто!</p>
          <HowWeWork />
        </div>
      </template>
    </BasicSection>
    <Footer id="contacts"/>
    <Lightbox>
      <CallbackPopup/>
    </Lightbox>
  </div>
</template>

<script>
export default {
  name: 'IndexPage',
  computed: {
    callbackPopupIsOpen() {
      return this.$store.state.popups.callbackPopupIsOpen
    }
  },
  data() {
    return {
      uslugi: {
        kvarcvinil: {
          title: 'Укладка кварцвинила',
          bannerImage: 'ukladka-kvarcvinila.jpg',
          bannerText: [
            'Кварц винил это: современное и технологичное напольное покрытие, обладающее огромным количеством преимуществ. Но если не соблюдать основные правила при укладке, можно столкнуться в будущем с проблемами при эксплуатации.',
            'Влажность воздуха должна находиться в пределах 40-60%, иначе просушиваем помещение или наоборот, ставим увлажнитель. Температура 17 - 24 градусов по Цельсию. Ровность пола: допускаются перепады до 2 мм на 2 кв.м., если больше, то делаем заливку ровнителем или шлифовку.'
          ],
          price: [
            {
              name: 'Укладка  ПВХ плитки/планки, клеевая (паралельно стенам)',
              value: 'от 350р м/кв'
            },
            {
              name: 'Укладка  ПВХ плитки/планки, клеевая (диагональная раскладка)',
              value: 'от 450р м/кв'
            },
            {
              name: 'Укладка  ПВХ плитки/планки (дизайнерская раскладка), клеевая',
              value: 'от 450р м/кв'
            },
            {
              name: 'Укладка  ПВХ плитки/планки, клеевая (на стену)',
              value: 'от 500р м/кв'
            },
            {
              name: 'Укладка  Пробки плитки/планки, клеевая (на стену)',
              value: 'от 500р м/кв'
            },
            {
              name: 'Укладка кварцвинила (ПВХ, SPC) замковый тип (паралельно стенам)',
              value: 'от 270р м/кв'
            },
            {
              name: 'Укладка кварцвинила (ПВХ, SPC) замковый тип (диагональная раскладка)',
              value: 'от 350р м/кв'
            },
          ],
          cases: [
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc1.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc2.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc3.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc4.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc5.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            }
          ]
        },
        laminat: {
          title: 'Укладка ламината',
          bannerImage: 'ukladka-laminata.jpg',
          bannerText: [
            'Ламинат – практичный и долговечный материал, который имитирует натуральное дерево или камень. Благодаря замковой системе укладка проходит без помощи клея, на подложку. Не боится тяжелой мебели, стульев и каблуков.',
            'Менеджеры помогут подобрать цвет и рассчитать точное количество ламината из каталога. Доставка осуществляется со склада.',
            'Класс эксплуатации. Выбирают по нагрузке и типу объектов: для квартиры и дома – 31 и 32, коммерческих помещений: 33 и 34. Толщина. Бывает от 7 до 14 мм, что удобно для выхода в один уровень с другими напольными покрытиями, например, плиткой.'
          ],
          additionalText: [
            'Возможно, вы слышали, что ламинат всегда стоит начинать укладывать слева направо, с левого угла длинной части комнаты. Эту рекомендацию приводят как истину в последней инстанции, не предлагая никаких альтернатив. На самом деле, подобное решение хоть и широко распространено, но далеко не всегда является оптимальным. Монтаж ламината можно начинать с ЛЮБОГО угла в комнате.',
            'Направление укладки. Обычно ламинат кладут слева направо по очевидной причине – так просто удобнее для большинства, ведь крепление ламината расположено для праворуких людей. Но если вы левша и привыкли работать в другом направлении, так и стоит поступить. Планки ламината устроены таким образом, что они могут крепиться с обеих сторон, а значит ничего не помешает вам укладывать ламинат, двигаясь с правой стороны.',
            'Способ сборки ламината. Стоит учитывать, как именно скрепляются вместе элементы ламината. Горизонтальное крепление даёт вам чуть больше простора для выбора направления. Проще всего попробовать соединить две планки вместе и посмотреть, в какую сторону вам это делать удобнее.',
            'Освещение в комнате и различное покрытие. Нередко ламинат имеет фаску или тиснение. В таком случае стоит заранее изучить, как именно свет будет падать на изделие. Фаска будет смотреться более выгодно, если свет падает под углом. В таком случае стоит использовать поперечную укладку, а это проще делать с одного из углов наружной стены – левого или правого, в зависимости от ваших предпочтений.',
            'Тиснение будет выгодно смотреться на свету в любом случае, поэтому тут не стоит переживать насчёт освещения. Вы можете выполнять укладку из любого угла и в любом направлении.',
          ],
          price: [
            {
              name: 'Укладка ламината (паралельно стенам)',
              value: 'от 220р м/кв'
            },
            {
              name: 'Укладка ламината (паралельно стенам) одной плитой, без порогов',
              value: 'от 300р м/кв'
            },
            {
              name: 'Укладка ламината (диагональная раскладка) одной плитой, без порогов',
              value: 'от 350р м/кв'
            },
            {
              name: 'Укладка ламината (елочка)',
              value: 'от 600р м/кв'
            },
            {
              name: 'Укладка ламината (широкоформатный)',
              value: 'от 450р м/кв'
            },
            {
              name: 'Укладка гидроизоляционной пленки',
              value: 'от 30р м/кв'
            },
            {
              name: 'Обработка замков герметиком',
              value: 'от 40р м/кв'
            },
          ],
          cases: [
            {
              src: 'img/cases/laminat/laminat1.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
            {
              src: 'img/cases/laminat/laminat2.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
            {
              src: 'img/cases/laminat/laminat3.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
            {
              src: 'img/cases/laminat/laminat4.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
            {
              src: 'img/cases/laminat/laminat5.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
            {
              src: 'img/cases/laminat/laminat6.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
            {
              src: 'img/cases/laminat/laminat7.jpg',
              title: 'Ламинат',
              alt: 'Пример работ по укладке ламината'
            },
          ]
        },
        kovrolin: {
          title: 'Укладка ковролина',
          bannerImage: 'ukladka-kovrolina.jpg',
          bannerText: [
            'Ковролин или ковролиновая плитка относится к наиболее популярным напольным покрытиям. Это не удивительно, ведь у него есть существенные преимущества: он обеспечивает теплоизоляцию и уменьшает шум шагов. Благодаря огромному выбору видов, цветовых решений и узоров можно достичь практически любого эффекта при оформлении помещения. Ковровые покрытия из таких натуральных волокон, как джут, кокос и сизаль регулируют влажность воздуха, обеспечивая приятный климат в помещении. Заказывая у нас укладку ковролина вы можете быть уверены в том что работаете с лучшими в Ижевске. Мы, например укладывали ковролин даже в таких нагруженных местах как кинотеатры.',
          ],
          price: [
            {
              name: 'Укладка ковровой плитки',
              value: 'от 400р м/кв'
            },
            {
              name: 'Укладка ковролина (без фиксации к основанию пола)',
              value: 'от 220р м/кв'
            },
            {
              name: 'Укладка ковролина (фиксация на скотч)',
              value: 'от 250р м/кв'
            },
            {
              name: 'Укладка ковролина (полное приклеивание к основанию пола)',
              value: 'от 350р м/кв'
            },
          ],
          cases: [
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc1.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc2.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc3.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc4.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc5.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            }
          ]
        },
        linoleum: {
          title: 'Укладка линолеума',
          bannerImage: 'ukladka-linoleuma.jpg',
          bannerText: [
            'Укладка линолеума кажется простым занятием, которое легко сделать своими руками но экономия не всегда гарантирует хороший результат. Лучше доверить работу профессионалам, которые знают все тонкости процесса и особенности укладки ПВХ покрытия на разные основания.',
            'Компания «Проф-Пол» не только продаёт качественные напольные покрытия, но и оказывает профессиональные услуги по их укладке в Ижевске с гарантией.',
            'У нас вы можете заказать укладку как домашнего так и спортивного линолеума.',
          ],
          price: [
            {
              name: 'Укладка бытового линолеума (без фиксации к основанию пола)',
              value: 'от 150р м/кв'
            },
            {
              name: 'Укладка бытового линолеума  (фиксация на скотч)',
              value: 'от 180р м/кв'
            },
            {
              name: 'Укладка бытового линолеума (полное приклеивание к основанию пола)',
              value: 'от 220р м/кв'
            },
            {
              name: 'Укладка коммерческого линолеума (полное приклеивание к основанию пола)',
              value: 'от 270р м/кв'
            },
            {
              name: 'Сварка швов линолеума холодным способом',
              value: 'от 120р м/пог'
            },
            {
              name: 'Сварка швов линолеума горячим способом (ПВХ шнур)',
              value: 'от 180р м/пог'
            },
            {
              name: 'Укладка спортивного линолеума (полное приклеивание к основанию пола)',
              value: 'от 350р м/кв'
            },
            {
              name: 'Укладка натурального линолеума (полное приклеивание к основанию пола)',
              value: 'от 450р м/кв'
            },
          ],
          cases: [
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc1.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc2.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc3.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc4.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc5.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            }
          ]
        },
        parket: {
          title: 'Укладка паркетной доски',
          bannerImage: 'ukladka-parketa.jpg',
          bannerText: [
            'Паркетный пол продолжает пользоваться популярностью и востребованностью в нашей стране, так как он с одной стороны красив и полезен для здоровья, а с другой практичен и долговечен. И самым популярным видом паркета является паркетная доска. Данный вид паркета характеризуется доступной ценой, разнообразием расцветки и текстуры. Однако все эти преимущества могут быть сведены на нет при неправильном монтаже. Мы укладываем паркет в Ижевске и Удмуртии уже более 5 лет и за это время накопили немало опыта, поэтому мы на 100% отвечаем за качество монтажа.',
            'Доверять укладку паркетной доски необходимо только опытным мастерам с большим стажем работы. Грамотный специалист учитывает особенности материалов и соблюдает все требования ГОСТов и рекомендации производителя при работе по укладке. Благодаря этому покрытие служит длительное время без потери первоначальных характеристик.'
          ],
          price: [
            {
              name: 'Укладка паркетной доски (паралельно стенам)',
              value: 'от 350р м/кв'
            },
            {
              name: 'Укладка паркетной доски (паралельно стенам) одной плитой, без порогов',
              value: 'от 400р м/кв'
            },
            {
              name: 'Укладка паркетной доски (диагональная раскладка) одной плитой, без порогов',
              value: 'от 500р м/кв'
            },
          ],
          cases: [
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc1.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc2.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc3.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc4.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc5.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            }
          ]
        },
        plintus: {
          title: 'Укладка плинтуса',
          bannerImage: 'ukladka-plintusa.jpg',
          bannerText: [
            'Мы занимаемся установкой напольного плинтуса в Ижевске уже давно, и обладаем огромным опытом. Незначительная на первый взгляд работа играет решающую роль в создании целостного гармоничного интерьера. Малейшее нарушение в технологии монтажа может внести дисбаланс в общую картинку и обесценить усилия, затраченные на благоустройство помещения.',
            'Напольный плинтус выполняет важную декоративную функцию, но его основное назначение — утилитарное: он закрывают зазоры и стыки, маскирует элементы проводки, а в некоторых случаях в плинтусы встраивают розетки. Именно поэтому монтаж должны проводить высококлассные специалисты, ведь некачественный монтаж может испортить любой, даже самый дорогой плинтус, не говоря уже о щелях собирающих пыль и бросающихся в глаза которые часто оставляют после себя непрофессионалы.'
          ],
          price: [
            {
              name: 'Установка плинтуса пластикового ПВХ (высотой до 7 см)',
              value: 'от 80р м/пог'
            },
            {
              name: 'Установка плинтуса пластикового ПВХ (высотой свыше 7 см)',
              value: 'от 100р м/пог'
            },
            {
              name: 'Установка плинтуса деревянного, МДФ, дюрополимер  (высотой до 10 см)',
              value: 'от 350р м/пог'
            },
            {
              name: 'Установка плинтуса деревянного, МДФ, дюрополимер  (высотой свыше 10 см)',
              value: 'от 400р м/пог'
            },
            {
              name: 'Установка порогов алюминиевых',
              value: 'от 200р м/пог'
            },
            {
              name: 'Установка порогов алюминиевых настенных',
              value: 'от 500р м/пог'
            },
            {
              name: 'Установка порогов мдф',
              value: 'от 450р м/пог'
            },
            {
              name: 'Установка порогов пвх, гибкий стык',
              value: 'от 500р м/пог'
            },
          ],
          cases: [
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc1.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc2.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc3.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc4.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc5.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            }
          ]
        },
        svarkaLinoleuma: {
          title: 'Сварка линолеума',
          bannerImage: 'svarka-linoleuma.jpg',
          bannerText: [
            'Мы единственная компания в Ижевске которая может профессионально и с гарантией сварить швы линолеума ПВХ шнуром. Для того, чтобы линолеум прослужил вам как можно дольше, швы не становились черными от грязи, а стыки не «отходили» от попадания влаги при уборке помещения, швы линолеума необходимо в обязательном порядке заваривать.',
          ],
          price: [
            {
              name: 'Сварка швов линолеума холодным способом',
              value: 'от 120р м/пог'
            },
            {
              name: 'Сварка швов линолеума горячим способом (ПВХ шнур)',
              value: 'от 180р м/пог'
            },
          ],
          cases: [
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc1.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc2.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc3.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc4.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            },
            {
              src: 'img/cases/ukladka-kvarcvinila/kvartc5.jpg',
              title: 'Кварцвинил ',
              alt: 'Пример работ по укладке кварцвинила'
            }
          ]
        },
        polirovkaLinoleuma: {
          title: 'Полировка линолеума',
          bannerImage: 'polirovka-linoleuma.png',
          bannerText: [
            'Мы единственная компания в Ижевске которая профессионально и с гарантией полирует коммерческий линолеум. Отсутствие ухода за покрытием и его повседневная эксплуатация ведет к быстрому износу и изменению первоначального внешнего вида линолеума.',
            'Грязь, особенно с наличием частиц песка и повышенные нагрузки на напольное покрытие въедается и повреждает верхний поверхностный слой линолеума и тем самым создает неопрятный внешний вид.',
            'Особенно это актуально в помещениях с высокой проходимостью: торговые павильоны, офисные помещения, производственные помещения и т. п.. В таких помещениях видны протоптанные темно-серые дорожки, особенно в проходных местах и во входной группе, а также большое количество мелких царапин на верхнем слое линолеума.',
          ],
        },
      }
    }
  },
}
</script>
